[
  {
    "id": 1,
    "title": "Unified Modeling Language (UML)",
    "image": "assets/images/merise/uml.webp",
    "description": "L'Unified Modeling Language (UML) est un langage de modélisation standardisé qui permet de représenter, de visualiser, de construire et de documenter la composition d'un système logiciel. Il a été pensé à partir du début des années 80 par Jim Rumbaugh, Grady Booch et Ivar Jacobson puis normalisé, dans sa version 1.0, en janvier 1997.\n\nVoici quelques points clés concernant sa version actuelle (v2.5) :\n\t- Langage Graphique : L'UML est avant tout un langage visuel. Il utilise des diagrammes pour représenter différents aspects d'un système, de la haute conception à la logique détaillée.\n\t- Polyvalence : UML est utilisé pour modéliser de nombreux types de systèmes, des systèmes logiciels aux processus d'affaires, en passant par les systèmes embarqués.\n\t- Standardisation : L'UML est géré par l'Object Management Group (OMG) et a subi plusieurs révisions depuis sa création.\n\t- Outil de Communication : L'UML sert de pont entre les parties prenantes non techniques et les développeurs. Grâce à ses diagrammes, il est possible d'avoir une vue claire et compréhensible des exigences, de la conception et du comportement du système.\n\t- Intégration avec les Méthodologies : Bien que l'UML soit un langage de modélisation et non une méthodologie en soi, il est souvent utilisé en conjonction avec des méthodologies de développement comme le Rational Unified Process (RUP) ou l'Agile.\n\t- Extensibilité : L'UML peut être étendu à l'aide de profils pour répondre à des besoins spécifiques. Ces profils permettent d'ajouter de nouvelles stéréotypes, tag values et contraintes pour s'adapter à des domaines ou des plateformes particuliers.\n\nLes diagrammes UML se divisent en deux groupes, les diagrammes structurels et comportementaux :\n\t- Diagrammes structurels : illustration de la structure d'un système (classes, objets, composants...) ainsi que leurs relations.\n\t- Diagrammes comportementaux : représente les interactions internes au système et entre le système et ses utilisateurs, d'autres systèmes et entités.\n\nEn conclusion, l'UML est un outil puissant et flexible pour la modélisation de systèmes. Il facilite la communication entre les équipes, offre une visualisation claire de la conception et des processus, et est largement reconnu et utilisé dans l'industrie du logiciel.",
    "link": "uml"
  },
  {
    "id": 2,
    "image": "assets/images/merise/merise.webp",
    "title": "Méthode Merise",
    "description": "Méthode d'Etude et de Réalisation Informatique des Systèmes d'Entreprise ou MERISE est, pour résumer, une démarche de construction de système d'information, ou encore une méthode pour concevoir un système d'information pour une entreprise. Cette méthode, née à la fin des années 70 en France, avait pour but de doter l'administration d'une methode de conception des projets informatiques en respectant les couts et délais.\nLe système d'information (SI), peut être défini comme un ensemble organisé de ressources qui permet de collecter (saisie), stocker (BDD), traiter (services) et distribuer (UI/déploiement) de l'information. Il se situe, en entreprise, entre le décisionnel (système de pilotage) et l'operationnel (système opérant). \nConcretement, cela consiste à créer des diagrammes afin de préparer la construction du SI.\nMERISE se situe, dans le cycle de vie d'un logiciel, dans la phase de conception, c'est-à-dire entre l'analyse des besoins et la phase de programmation. \n\n3 découpages sur 4 niveaux : découpage entre la communication (flux d'informations et messages entre systèmes), le traitement (traitement des messages) et les données (structure de mémorisation des informations : tables et champs) sur 4 niveaux : conceptuel (que fait l'entreprise ?), organisationnel (qui fait quoi ?), logique (informatique sans langage ou SGBD spécifique) et physique (comment ?).\n\t- Approche Modulaire : MERISE divise le système d'information en sous-systèmes pour simplifier la conception. Chaque sous-système correspond à une fonctionnalité ou à un ensemble de fonctionnalités du système global.\n\t- Séparation des Données et des Traitements : L'une des caractéristiques fondamentales de MERISE est de séparer clairement la manière dont les données sont organisées de la manière dont elles sont traitées. Cela permet d'avoir une vision claire de la structure des données indépendamment des traitements appliqués.\n\t- Modélisation : MERISE utilise des modèles pour représenter les différentes vues du système :\n\t- Cycle de vie : La méthode MERISE propose un cycle de vie pour le développement des projets, incluant différentes phases telles que l'expression des besoins, l'analyse, la conception détaillée, la réalisation, la mise en œuvre et la maintenance.\n\t- Participation Active des Utilisateurs : MERISE insiste sur la nécessité d'impliquer les utilisateurs finaux dès le début du projet et tout au long du processus pour s'assurer que le système répondra à leurs besoins réels.\n\nEn conclusion, MERISE offre une approche structurée pour la conception de systèmes d'information. Même si elle est moins utilisée aujourd'hui face à de nouvelles méthodologies (notamment l'UML), elle a formé la base de nombreuses pratiques actuelles en matière de développement de systèmes.",
    "link": "merise"
  }
]
